goalify/app/controllers/users_controller.rb

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "billiebob5"], ["password_digest", "$2a$12$wt0lokGF5DwUScGqbMa0p.ezGC5/ZYbBMTsvrEDnve/ggZ4RWWxT2"], ["updated_at", "2020-11-05 00:43:21.382309"], ["id", 146]]